# GetOverridableHookParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..GetOverridableHookParameters Method
Rebar Class See Also
---
Outputs the formula parameter ids defined in the RebarShape family which are associated with hook length and hook tangent length parameters.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public void GetOverridableHookParameters(
	out ISet<ElementId> startHookLengthPrameters,
	out ISet<ElementId> startHookTangentLengthParameters,
	out ISet<ElementId> endHookLengthParameters,
	out ISet<ElementId> endHookTangentLengthParameters
)
```

Visual Basic
---
```text
Public Sub GetOverridableHookParameters ( _
	<OutAttribute> ByRef startHookLengthPrameters As ISet(Of ElementId), _
	<OutAttribute> ByRef startHookTangentLengthParameters As ISet(Of ElementId), _
	<OutAttribute> ByRef endHookLengthParameters As ISet(Of ElementId), _
	<OutAttribute> ByRef endHookTangentLengthParameters As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
void GetOverridableHookParameters(
	[OutAttribute] ISet<ElementId^>^% startHookLengthPrameters,
	[OutAttribute] ISet<ElementId^>^% startHookTangentLengthParameters,
	[OutAttribute] ISet<ElementId^>^% endHookLengthParameters,
	[OutAttribute] ISet<ElementId^>^% endHookTangentLengthParameters
)
```

# ### Parameters
startHookLengthPrameters
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)>% The formula parameter ids defined in the RebarShape family which are associated with start hook length parameters.
startHookTangentLengthParameters
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)>% The formula parameter ids defined in the RebarShape family which are associated with start hook tangent length parameters.
endHookLengthParameters
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)>% The formula parameter ids defined in the RebarShape family which are associated with end hook length parameters.
endHookTangentLengthParameters
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)>% The formula parameter ids defined in the RebarShape family which are associated with end hook tangent length parameters.
# Remarks
Will throw an exception if the hook length override is not enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The ability to override hook lengths is not enabled for this rebar instance. Use enableHookLengthOverride(true) to enable it. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace